Deep-Learning/MiMo-V2.5-Pro-on-MI300X-Benchmark/data/raw-logs/20260713-amd-tuned-moe-expanded-concurrency/points/dp2/benchmark_65536_out1_con4.log
/opt/venv/lib/python3.10/site-packages/transformers/modeling_rope_utils.py:1034: FutureWarning: `rope_config_validation` is deprecated and has been removed. Its functionality has been moved to RotaryEmbeddingConfigMixin.validate_rope method. PreTrainedConfig inherits this class, so please call self.validate_rope() instead. Also, make sure to use the new rope_parameters syntax. You can call self.standardize_rope_params() in the meantime.
  warnings.warn(
benchmark_args=Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=65536, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://<ip>:40000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url=None, host='<ip>', port=40000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='/data/mimo-public/ShareGPT_V3_unfiltered_cleaned_split.json', speed_bench_category=None, speed_bench_output_len=512, model='/data/models/MiMo-V2.5-Pro', served_model_name=None, tokenizer=None, num_prompts=32, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=65536, random_output_len=1, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=4, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=12345, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=True, profile_prefill_url=None, profile_decode_url=None, flush_cache=True, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2097152
#Output tokens: 32
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

  0%|          | 0/32 [00:00<?, ?it/s]
  3%|▎         | 1/32 [00:03<01:41,  3.27s/it]
  9%|▉         | 3/32 [00:06<01:01,  2.11s/it]
 16%|█▌        | 5/32 [00:10<00:51,  1.90s/it]
 19%|█▉        | 6/32 [00:10<00:36,  1.42s/it]
 22%|██▏       | 7/32 [00:13<00:48,  1.93s/it]
 25%|██▌       | 8/32 [00:13<00:33,  1.42s/it]
 28%|██▊       | 9/32 [00:16<00:45,  1.97s/it]
 31%|███▏      | 10/32 [00:17<00:31,  1.43s/it]
 34%|███▍      | 11/32 [00:20<00:41,  1.99s/it]
 38%|███▊      | 12/32 [00:20<00:28,  1.43s/it]
 41%|████      | 13/32 [00:23<00:38,  2.00s/it]
 44%|████▍     | 14/32 [00:23<00:25,  1.44s/it]
 47%|████▋     | 15/32 [00:27<00:33,  1.99s/it]
 50%|█████     | 16/32 [00:27<00:22,  1.44s/it]
 53%|█████▎    | 17/32 [00:30<00:30,  2.01s/it]
 56%|█████▋    | 18/32 [00:30<00:20,  1.44s/it]
 59%|█████▉    | 19/32 [00:34<00:25,  2.00s/it]
 66%|██████▌   | 21/32 [00:37<00:20,  1.86s/it]
 72%|███████▏  | 23/32 [00:41<00:16,  1.82s/it]
 78%|███████▊  | 25/32 [00:44<00:12,  1.77s/it]
 84%|████████▍ | 27/32 [00:47<00:08,  1.74s/it]
 88%|████████▊ | 28/32 [00:47<00:05,  1.43s/it]
 91%|█████████ | 29/32 [00:51<00:05,  1.84s/it]
 94%|█████████▍| 30/32 [00:51<00:02,  1.44s/it]
 97%|█████████▋| 31/32 [00:54<00:01,  1.87s/it]
100%|██████████| 32/32 [00:54<00:00,  1.41s/it]
100%|██████████| 32/32 [00:54<00:00,  1.71s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 4         
Successful requests:                     32        
Benchmark duration (s):                  54.64     
Total input tokens:                      2097152   
Total input text tokens:                 2097152   
Total generated tokens:                  32        
Total generated tokens (retokenized):    32        
Request throughput (req/s):              0.59      
Input token throughput (tok/s):          38382.03  
Output token throughput (tok/s):         0.59      
Peak output token throughput (tok/s):    2.00      
Peak concurrent requests:                6         
Total token throughput (tok/s):          38382.62  
Concurrency:                             3.87      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   6615.28   
Median E2E Latency (ms):                 6796.30   
P90 E2E Latency (ms):                    6982.29   
P95 E2E Latency (ms):                    6994.03   
P99 E2E Latency (ms):                    7016.26   
---------------Time to First Token----------------
Mean TTFT (ms):                          6615.25   
Median TTFT (ms):                        6796.28   
P90 TTFT (ms):                           6982.26   
P95 TTFT (ms):                           6994.01   
P99 TTFT (ms):                           7016.23   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P90 TPOT (ms):                           0.00      
P95 TPOT (ms):                           0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-Token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P90 ITL (ms):                            0.00      
P95 ITL (ms):                            0.00      
P99 ITL (ms):                            0.00      
Max ITL (ms):                            0.00      
==================================================